{
    "class_name": "Model",
    "config": {
        "name": "model",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_0"
                },
                "name": "input_0",
                "inbound_nodes": []
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "307",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "307",
                "inbound_nodes": [
                    [
                        [
                            "input_0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "308",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "308",
                "inbound_nodes": [
                    [
                        [
                            "307",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "309",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "309",
                "inbound_nodes": [
                    [
                        [
                            "308",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "DepthwiseConv2D",
                "config": {
                    "name": "310",
                    "trainable": true,
                    "dtype": "float32",
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                },
                "name": "310",
                "inbound_nodes": [
                    [
                        [
                            "309",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "311",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "311",
                "inbound_nodes": [
                    [
                        [
                            "310",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "312",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "312",
                "inbound_nodes": [
                    [
                        [
                            "311",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "313",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "313",
                "inbound_nodes": [
                    [
                        [
                            "312",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "314",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "314",
                "inbound_nodes": [
                    [
                        [
                            "313",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "315",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 96,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "315",
                "inbound_nodes": [
                    [
                        [
                            "314",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "316",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "316",
                "inbound_nodes": [
                    [
                        [
                            "315",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "317",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "317",
                "inbound_nodes": [
                    [
                        [
                            "316",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "DepthwiseConv2D",
                "config": {
                    "name": "318",
                    "trainable": true,
                    "dtype": "float32",
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                },
                "name": "318",
                "inbound_nodes": [
                    [
                        [
                            "317",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "319",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "319",
                "inbound_nodes": [
                    [
                        [
                            "318",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "320",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "320",
                "inbound_nodes": [
                    [
                        [
                            "319",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "321",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 24,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "321",
                "inbound_nodes": [
                    [
                        [
                            "320",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "322",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "322",
                "inbound_nodes": [
                    [
                        [
                            "321",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "323",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 144,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "323",
                "inbound_nodes": [
                    [
                        [
                            "322",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "324",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "324",
                "inbound_nodes": [
                    [
                        [
                            "323",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "325",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "325",
                "inbound_nodes": [
                    [
                        [
                            "324",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "DepthwiseConv2D",
                "config": {
                    "name": "326",
                    "trainable": true,
                    "dtype": "float32",
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                },
                "name": "326",
                "inbound_nodes": [
                    [
                        [
                            "325",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "327",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "327",
                "inbound_nodes": [
                    [
                        [
                            "326",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "328",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "328",
                "inbound_nodes": [
                    [
                        [
                            "327",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "329",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 24,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "329",
                "inbound_nodes": [
                    [
                        [
                            "328",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "330",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "330",
                "inbound_nodes": [
                    [
                        [
                            "329",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "331",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "331",
                "inbound_nodes": [
                    [
                        [
                            "322",
                            0,
                            0,
                            {}
                        ],
                        [
                            "330",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "332",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 144,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "332",
                "inbound_nodes": [
                    [
                        [
                            "331",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "333",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "333",
                "inbound_nodes": [
                    [
                        [
                            "332",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "334",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "334",
                "inbound_nodes": [
                    [
                        [
                            "333",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "DepthwiseConv2D",
                "config": {
                    "name": "335",
                    "trainable": true,
                    "dtype": "float32",
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                },
                "name": "335",
                "inbound_nodes": [
                    [
                        [
                            "334",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "336",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "336",
                "inbound_nodes": [
                    [
                        [
                            "335",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "337",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "337",
                "inbound_nodes": [
                    [
                        [
                            "336",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "338",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "338",
                "inbound_nodes": [
                    [
                        [
                            "337",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "339",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "339",
                "inbound_nodes": [
                    [
                        [
                            "338",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "340",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 192,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_first",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "340",
                "inbound_nodes": [
                    [
                        [
                            "339",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "341",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "momentum": 0.8999999761581421,
                    "epsilon": 9.999999747378752e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "341",
                "inbound_nodes": [
                    [
                        [
                            "340",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "342",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "342",
                "inbound_nodes": [
                    [
                        [
